eeyrw/stm32f0-example/user/main.c
#include "stm32f0xx.h"
#include "stm32f0xx_conf.h"
#include <stdlib.h>

void Delay(uint32_t t)
{
  for(uint32_t i=t;i>1;--i)
  {
    for(uint32_t p=0;p<0xff;p++)
    {
      asm("nop");
    }
    
  }
}
int main(void)
{
  GPIO_InitTypeDef        GPIO_InitStructure;
  /* GPIOC Periph clock enable */
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);

  /* Configure PC10 and PC11 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  volatile uint8_t *p;
  p=malloc(100);
  p[1]=1;
  printf("That's fine.");
  while (1)
  {
    /* Set PB1 */
    GPIOB->BSRR = 1<<1;
    Delay(0xfff);
    
    /* Reset PB1 */
    GPIOB->BRR = 1<<1;
    Delay(0xfff);
  }
  return 0;
}


#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
